{
  "news": [
    {
      "id": "1",
      "title": "New Luxury Yacht Added to Our Fleet",
      "image": "/images/news-yacht.jpg",
      "date": "2024-03-15",
      "category": "Fleet Updates",
      "summary": "We're excited to announce the addition of a stunning 75-foot luxury yacht to our Vilamoura fleet.",
      "content": "We are thrilled to announce the latest addition to our prestigious fleet - a magnificent 75-foot luxury yacht that sets new standards in maritime excellence. This state-of-the-art vessel combines elegant design with cutting-edge technology, offering our members an unparalleled experience on the Algarve waters. The yacht features spacious entertainment areas, premium amenities, and the latest navigation systems.",
      "author": "Maria Santos",
      "tags": ["Fleet", "Luxury", "New Arrival"]
    },
    {
      "id": "2",
      "title": "Summer 2024 Special Packages Announced",
      "image": "/images/news-summer.jpg",
      "date": "2024-03-10",
      "category": "Promotions",
      "summary": "Discover our exclusive summer packages with special discounts for Clever Details members.",
      "content": "Get ready for an unforgettable summer with our specially curated packages for 2024. We've designed unique experiences that combine the best of Vilamoura's maritime offerings with exclusive member benefits. From sunset cruises to full-day adventures, our packages cater to every preference. Early bird bookings receive additional discounts and premium amenities.",
      "author": "João Silva",
      "tags": ["Summer", "Offers", "Packages"]
    },
    {
      "id": "3",
      "title": "New Partnership with Michelin-Star Restaurant",
      "image": "/images/news-dining.jpg",
      "date": "2024-03-05",
      "category": "Partnerships",
      "summary": "Elevate your dining experience with our new exclusive partnership with Vila Marina Restaurant.",
      "content": "We're proud to announce our collaboration with Vila Marina, the renowned Michelin-star restaurant in Vilamoura. This partnership brings exclusive dining privileges to our members, including priority reservations, special tasting menus, and unique chef's table experiences. The restaurant's award-winning cuisine perfectly complements our luxury maritime offerings.",
      "author": "Ana Costa",
      "tags": ["Dining", "Partnership", "Luxury"]
    }
  ]
} 